function [H] = mbe_basedHVS(imageFile, Key)
%*******************************************
%一种基于视觉特性的图像摘要算法
%作者秦川，王朔中等
%中国图象图形学报，2006.11第11期
%对512，512规格化图像进行哈希提取并生成64bit哈希值
%********************************************
im = imread(imageFile);
im = imresize(im,[512,512]);
if(length(size(im))>2)
    im = rgb2gray(im);
end
im = double(im);
% Key=10;
T = dctmtx(8);
im = blkproc(im, [8 8], 'P1 * x * P2',T,T');
% fun =@dct2;
% im = blkproc(im,[8,8],fun);
t=[ 71.43 99.01 86.21 60.24 41.67 29.16 20.88 15.24;
    99.01 68.97 75.76 65.79 50.00 36.90 27.25 20.28;
    86.21 75.76 44.64 38.61 33.56 27.47 21.74 17.01;
    60.24 65.79 38.61 26.53 21.98 18.87 15.92 13.16;
    41.67 50.00 33.56 21.98 16.26 13.14 11.48 9.83;
    29.16 36.90 27.47 18.87 13.14 10.40 8.64  7.40;
    20.88 27.25 21.74 15.92 11.48 8.64  6.90  5.78;
    15.24 20.28 17.01 13.16 9.83  7.40  5.78  4.73];
mp = padarray(t, [252,252],'circular');
randn('seed',Key);
H=ones(1,64);
for k=1:64
    
    y=0;
    r= randn(512);
    for i=1:512
        for j=1:512
            y=y+im(i,j)*mp(i,j)*r(i,j);
        end
    end
    if y<0
        H(k)=0;
    end
end